Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_364 (Conv2D)          (None, 254, 254, 32)      896       
_________________________________________________________________
batch_normalization_207 (Bat (None, 254, 254, 32)      128       
_________________________________________________________________
activation_222 (Activation)  (None, 254, 254, 32)      0         
_________________________________________________________________
conv2d_365 (Conv2D)          (None, 252, 252, 32)      9248      
_________________________________________________________________
batch_normalization_208 (Bat (None, 252, 252, 32)      128       
_________________________________________________________________
activation_223 (Activation)  (None, 252, 252, 32)      0         
_________________________________________________________________
max_pooling2d_179 (MaxPoolin (None, 126, 126, 32)      0         
_________________________________________________________________
conv2d_366 (Conv2D)          (None, 124, 124, 64)      18496     
_________________________________________________________________
batch_normalization_209 (Bat (None, 124, 124, 64)      256       
_________________________________________________________________
activation_224 (Activation)  (None, 124, 124, 64)      0         
_________________________________________________________________
conv2d_367 (Conv2D)          (None, 122, 122, 64)      36928     
_________________________________________________________________
batch_normalization_210 (Bat (None, 122, 122, 64)      256       
_________________________________________________________________
activation_225 (Activation)  (None, 122, 122, 64)      0         
_________________________________________________________________
max_pooling2d_180 (MaxPoolin (None, 61, 61, 64)        0         
_________________________________________________________________
conv2d_368 (Conv2D)          (None, 59, 59, 64)        36928     
_________________________________________________________________
batch_normalization_211 (Bat (None, 59, 59, 64)        256       
_________________________________________________________________
activation_226 (Activation)  (None, 59, 59, 64)        0         
_________________________________________________________________
conv2d_369 (Conv2D)          (None, 57, 57, 64)        36928     
_________________________________________________________________
batch_normalization_212 (Bat (None, 57, 57, 64)        256       
_________________________________________________________________
activation_227 (Activation)  (None, 57, 57, 64)        0         
_________________________________________________________________
max_pooling2d_181 (MaxPoolin (None, 28, 28, 64)        0         
_________________________________________________________________
conv2d_370 (Conv2D)          (None, 26, 26, 64)        36928     
_________________________________________________________________
batch_normalization_213 (Bat (None, 26, 26, 64)        256       
_________________________________________________________________
activation_228 (Activation)  (None, 26, 26, 64)        0         
_________________________________________________________________
conv2d_371 (Conv2D)          (None, 24, 24, 64)        36928     
_________________________________________________________________
batch_normalization_214 (Bat (None, 24, 24, 64)        256       
_________________________________________________________________
activation_229 (Activation)  (None, 24, 24, 64)        0         
_________________________________________________________________
max_pooling2d_182 (MaxPoolin (None, 12, 12, 64)        0         
_________________________________________________________________
dropout_106 (Dropout)        (None, 12, 12, 64)        0         
_________________________________________________________________
flatten_42 (Flatten)         (None, 9216)              0         
_________________________________________________________________
dense_126 (Dense)            (None, 512)               4719104   
_________________________________________________________________
batch_normalization_215 (Bat (None, 512)               2048      
_________________________________________________________________
activation_230 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_107 (Dropout)        (None, 512)               0         
_________________________________________________________________
dense_127 (Dense)            (None, 32)                16416     
_________________________________________________________________
batch_normalization_216 (Bat (None, 32)                128       
_________________________________________________________________
activation_231 (Activation)  (None, 32)                0         
_________________________________________________________________
dense_128 (Dense)            (None, 3)                 99        
_________________________________________________________________
batch_normalization_217 (Bat (None, 3)                 12        
_________________________________________________________________
activation_232 (Activation)  (None, 3)                 0         
=================================================================
Total params: 4,952,879
Trainable params: 4,950,889
Non-trainable params: 1,990
_________________________________________________________________